In [1]:
import pandas as pd
import numpy as np

### Import Data

In [3]:
df = pd.read_csv('data/ecommerce_sales_analysis.csv')

### Exploratory Data Analysis

In [5]:
df.shape

(1000, 18)

In [6]:
df.describe()

,product_id,price,review_score,review_count,sales_month_1,sales_month_2,sales_month_3,sales_month_4,sales_month_5,sales_month_6,sales_month_7,sales_month_8,sales_month_9,sales_month_10,sales_month_11,sales_month_12
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000
mean,500.500000,247.677130,3.027600,526.506000,498.306000,507.661000,506.739000,503.823000,487.194000,491.653000,507.011000,504.569000,491.934000,514.798000,505.83800,500.386000
std,288.819436,144.607983,1.171243,282.269932,289.941478,285.992689,294.010873,286.645567,287.844324,289.234018,291.047287,289.945691,287.514731,288.710119,288.82451,278.509459
min,1.000000,7.290000,1.000000,1.000000,0.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,0.000000,1.000000,0.00000,4.000000
25%,250.750000,121.810000,2.000000,283.750000,245.500000,262.500000,243.750000,261.500000,221.000000,236.000000,254.000000,240.500000,247.250000,267.000000,251.25000,259.000000
50%,500.500000,250.920000,3.100000,543.000000,507.500000,508.000000,493.000000,501.500000,497.000000,479.500000,522.500000,499.500000,495.500000,532.000000,502.00000,500.500000
75%,750.250000,373.435000,4.000000,772.000000,740.750000,756.250000,777.250000,749.500000,727.000000,740.500000,757.250000,762.250000,735.250000,770.250000,761.00000,730.000000
max,1000.000000,499.860000,5.000000,999.000000,1000.000000,1000.000000,999.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000

In [7]:
df.head()

,product_id,product_name,category,price,review_score,review_count,sales_month_1,sales_month_2,sales_month_3,sales_month_4,sales_month_5,sales_month_6,sales_month_7,sales_month_8,sales_month_9,sales_month_10,sales_month_11,sales_month_12
0,1,Product_1,Clothing,190.40,1.7,220,479,449,92,784,604,904,446,603,807,252,695,306
1,2,Product_2,Home & Kitchen,475.60,3.2,903,21,989,861,863,524,128,610,436,176,294,772,353
2,3,Product_3,Toys,367.34,4.5,163,348,558,567,143,771,409,290,828,340,667,267,392
3,4,Product_4,Toys,301.34,3.9,951,725,678,59,15,937,421,670,933,56,157,168,203
4,5,Product_5,Books,82.23,4.2,220,682,451,649,301,620,293,411,258,854,548,770,257

In [12]:
month1_sales_by_cat = df.groupby(['category'])['sales_month_1'].mean()
month1_sales_by_cat

category
Books             506.051948
Clothing          435.471429
Electronics       553.239130
Health            486.647482
Home & Kitchen    462.752000
Sports            508.084967
Toys              528.715232
Name: sales_month_1, dtype: float64

In [10]:
month2_sales_by_cat = df.groupby(['category'])['sales_month_2'].mean()
month2_sales_by_cat

category
Books             519.993506
Clothing          485.078571
Electronics       525.159420
Health            485.122302
Home & Kitchen    458.016000
Sports            537.542484
Toys              531.596026
Name: sales_month_2, dtype: float64

In [11]:
month3_sales_by_cat = df.groupby(['category'])['sales_month_3'].mean()
month3_sales_by_cat

category
Books             499.987013
Clothing          548.542857
Electronics       512.376812
Health            486.345324
Home & Kitchen    501.336000
Sports            490.908497
Toys              509.000000
Name: sales_month_3, dtype: float64

In [14]:
df['sales_month_1']

0      479
1       21
2      348
3      725
4      682
      ...
995    488
996     18
997    725
998    196
999    890
Name: sales_month_1, Length: 1000, dtype: int64

In [15]:
df['average_sales'] = df[
    ['sales_month_1', 
    'sales_month_2', 
    'sales_month_3', 
    'sales_month_4', 
    'sales_month_5', 
    'sales_month_6',
    'sales_month_7', 
    'sales_month_8', 
    'sales_month_9', 
    'sales_month_10', 
    'sales_month_11', 
    'sales_month_12'
]].mean(axis=1)

In [16]:
df.head()

,product_id,product_name,category,price,review_score,review_count,sales_month_1,sales_month_2,sales_month_3,sales_month_4,sales_month_5,sales_month_6,sales_month_7,sales_month_8,sales_month_9,sales_month_10,sales_month_11,sales_month_12,average_sales
0,1,Product_1,Clothing,190.40,1.7,220,479,449,92,784,604,904,446,603,807,252,695,306,535.083333
1,2,Product_2,Home & Kitchen,475.60,3.2,903,21,989,861,863,524,128,610,436,176,294,772,353,502.250000
2,3,Product_3,Toys,367.34,4.5,163,348,558,567,143,771,409,290,828,340,667,267,392,465.000000
3,4,Product_4,Toys,301.34,3.9,951,725,678,59,15,937,421,670,933,56,157,168,203,418.500000
4,5,Product_5,Books,82.23,4.2,220,682,451,649,301,620,293,411,258,854,548,770,257,507.833333